
#include"../Application/Application.h"

namespace {

	/* ========== Publicメンバー変数 ========== */

	/* ========== Publicメンバー関数 ========== */

	/* ========== Privateメンバー変数 ========== */

	/* ========== Privateメンバー関数 ========== */

	/* ========== Protectedメンバー変数 ========== */

	/* ========== Protectedメンバー関数 ========== */

	/* ========== Includeファイル ========== */

	/* ========== 名前空間 ========== */

	/* ========== 前方宣言 ========== */

	/* ===== 初期化関数 ===== */

	/* ===== 実行関数 ===== */

	/* ===== 取得関数 ===== */

	/* ===== 追加関数 ===== */

	/* ===== 終了関数 ===== */
}

/// <summary>
/// エントリー関数
/// </summary>
/// <returns>正常終了なら [ 0 ],エラーなら [ 1 ]</returns>
int main() {

	App::Application App{};

	if (!App.start_app()) {
		return 1;
	}
	
	return 0;
}