#pragma once
#include"../FrameResource.h"
#include<vector>
#include<memory>

///====================================================================
/// 描画名前空間
///====================================================================

namespace render {

	///====================================================================
	/// DirectX名前空間
	///====================================================================

	namespace dx12 {

		///====================================================================
		/// Factory名前空間
		///====================================================================

		namespace factory {

			///====================================================================
			/// FrameResourceFactory クラス
			///====================================================================

			//@brief	=== フレームリソースファクトリークラス ===
			class FrameResourceFactory final
			{
			public:
				///====================================================================
				/// Public メンバー関数
				///====================================================================

				//@brief	=== フレームリソース作成関数 ===
				//@param	device	DirectX12 デバイス
				//@param	size	フレームリソースサイズ
				//@param	out	受け渡すインスタンス
				//@return	作成の成否
				static [[nodiscard]] HRESULT create_frame_resources(ID3D12Device* device, UINT size, std::vector<std::unique_ptr<resouces::FrameResource>>& out);

			private:
				///====================================================================
				/// クラス設定
				///====================================================================

				//コンストラクタ,デストラクタ
				FrameResourceFactory() = default;
				~FrameResourceFactory() = default;

			};
		};
	};
};