#pragma once
#include"../DirectXobject/PiplineState.h"
#include"../AddFile/d3dx12.h"

///====================================================================
/// PiplineStateHepler クラス
///====================================================================

//@brief	=== パイプラインステートヘルパークラス ===
class PiplineStateHepler final
{
public:
	///====================================================================
	/// Public メンバー関数
	///====================================================================

	//@brief	=== ブレンド有効化設定作成関数 ===
	//@return	ブレンド有効化設定
	static [[nodiscard]] D3D12_BLEND_DESC get_enable_blend();

private:
	///====================================================================
	/// クラス設定
	///====================================================================

	//コンストラクタ,デストラクタ
	PiplineStateHepler() = default;
	~PiplineStateHepler() = default;
};