#pragma once
#include"../DirectXobject/GPUResource.h"

///====================================================================
/// 描画名前空間
///====================================================================

namespace render {

	///====================================================================
	/// DirectX名前空間
	///====================================================================

	namespace dx12 {

		///====================================================================
		/// Helper名前空間
		///====================================================================

		namespace helper {

			class ResourceCreateDescHelper final
			{
			public:
				///====================================================================
				/// P+ublic メンバー関数
				///====================================================================

				//@brief	=== ヒーププロパティ設定作成関数 ===
				//@param	type	ヒープタイプ設定
				//@return	作成したヒーププロパティ設定
				static [[nodiscard]] D3D12_HEAP_PROPERTIES get_heap_properties(D3D12_HEAP_TYPE type);

				//@brief	=== リソース設定作成関数 ===
				//@param	T_buffer_size	バッファメモリサイズ
				//@return	作成したリソース設定
				static [[nodiscard]] D3D12_RESOURCE_DESC get_buffer_desc(UINT T_buffer_size);

			private:
				///====================================================================
				/// クラス設定
				///====================================================================

				//コンストラクタ,デストラクタ
				ResourceCreateDescHelper() = default;
				~ResourceCreateDescHelper() = default;

			};
		};
	};
};