#pragma once
#include<d3d12.h>

///====================================================================
/// 描画名前空間
///====================================================================

namespace render {

	///====================================================================
	/// DirectX名前空間
	///====================================================================

	namespace dx12 {

		///====================================================================
		/// Helper名前空間
		///====================================================================

		namespace helper {

			///====================================================================
			/// ScissorRectHelper クラス
			///====================================================================

			//@brief	=== シザー短形ヘルパークラス ===
			class ScissorRectHelper final
			{
			public:
				///====================================================================
				/// Public メンバー関数
				///====================================================================

				//@brief	=== シザー短形作成関数 ===
				//@details	左上を [ 0,0 ] とした [ 描画クリッピング範囲 ] を決めれる構造体
				//@param	right	[ X軸 ] 右側の値
				//@param	bottom	[ Y軸 ] 下側の値
				//@param	left	[ X軸 ] 左側の値
				//@param	top		[ Y軸 ] 上側の値
				//@return	作成されたシザー短形
				static [[nodiscard]] D3D12_RECT create_scissor_rect(long right, long bottom, long left = 0, long top = 0);

			private:
				///====================================================================
				/// クラス設定
				///====================================================================

				//コンストラクタ,デストラクタ
				ScissorRectHelper() = default;
				~ScissorRectHelper() = default;

			};
		};
	};
};