#pragma once
#include<d3d12.h>

///====================================================================
/// 描画名前空間
///====================================================================

namespace render {

	///====================================================================
	/// DirectX名前空間
	///====================================================================

	namespace dx12 {

		///====================================================================
		/// Helper名前空間
		///====================================================================

		namespace helper {

			///====================================================================
			/// ViewportHelper クラス
			///====================================================================

			//@brief	=== ビューポートヘルパークラス ===
			class ViewportHelper final
			{
			public:
				///====================================================================
				/// Public メンバー関数
				///====================================================================

				//@brief	=== ビューポート作成関数 ===
				//@details	[ NDC座標 ] を [ ピクセル座標 ] に変換するのに必要な情報構造体を作成する関数
				//@param	width	ウィンドウの横幅
				//@param	height	ウィンドウの縦幅
				//@param	topX	起点となるX軸座標
				//@param	topY	起点となるY軸座標
				//@param	min_depth	最小深度値設定
				//@param	max_depth	最大深度値設定
				//@return	作成されたビューポート
				static [[nodiscard]] D3D12_VIEWPORT create_viewport(float width, float height,
					float topX = 0.0f, float topY = 0.0f, float min_depth = 0.0f, float max_depth = 1.0f);

			private:
				///====================================================================
				/// クラス設定
				///====================================================================

				//コンストラクタ,デストラクタ
				ViewportHelper() = default;
				~ViewportHelper() = default;

			};
		};
	};
};