#pragma once
#include<d3d12.h>
#include<vector>

///====================================================================
/// 描画名前空間
///====================================================================
namespace render {

	///====================================================================
	/// 描画設定名前空間
	///====================================================================

	namespace state {

		///====================================================================
		/// Drawstate クラス
		///====================================================================

		//@brief	=== 描画設定クラス ===
		class Drawstate final
		{
		public:
			///====================================================================
			/// クラス設定
			///====================================================================

			//コンストラクタ,デストラクタ
			Drawstate() = default;
			~Drawstate() = default;

			//コピー禁止,ムーブ禁止
			Drawstate(const Drawstate&) = delete;
			Drawstate& operator=(const Drawstate&) = delete;
			Drawstate(Drawstate&&) = delete;
			Drawstate& operator=(Drawstate&&) = delete;

			///====================================================================
			/// Public メンバー関数
			///====================================================================



		private:
			///====================================================================
			/// Private メンバー関数
			///====================================================================

			std::vector<ID3D12Resource*> render_targets{};

			ID3D12RootSignature* root_signature{};

			ID3D12PipelineState* pipline_state{};

			D3D12_VIEWPORT viewport_{};

			D3D12_RECT	rect_{};
		};
	}
}