#pragma once
#include"DirectXobject/PiplineState.h"
#include"AddFile/d3dx12.h"

///====================================================================
/// PiplineStateHepler クラス
///====================================================================

//@brief	=== パイプラインステートヘルパークラス ===
class PiplineStateHepler final
{
public:
	///====================================================================
	/// Public メンバー関数
	///====================================================================


private:
	///====================================================================
	/// クラス設定
	///====================================================================

	//コンストラクタ,デストラクタ
	PiplineStateHepler() = default;
	~PiplineStateHepler() = default;
};