#pragma once
#include"LogObject.h"	//LogObject

///====================================================================
/// DebugOutPutクラス
///====================================================================

//@brief	=== Debug出力担当クラス ===
class DebugLogOutPut final
{
public:
	///====================================================================
	/// Publicメンバー関数
	///====================================================================

	//@brief	=== 出力文字列受付関数 ===
	//@param	log	LogObject構造体
	static void ReceptionLog(const LogObject& log);
private:
	///====================================================================
	/// クラス設定
	///====================================================================

	//コンストラクタ,デストラクタ
	DebugLogOutPut() = default;
	~DebugLogOutPut() = default;

	///====================================================================
	/// Privateメンバー関数
	///====================================================================

	//@brief	=== 出力本体関数 ===
	//@param	log	Log文字列
	static void OutPutLog(const std::string& log);
};