#pragma once
#include"RenderTarget.h"

///====================================================================
/// 描画名前空間
///====================================================================

namespace render {

	///====================================================================
	/// DirectX名前空間
	///====================================================================

	namespace dx12 {

		///====================================================================
		/// DX12オブジェクトラッパークラス名前空間
		///====================================================================

		namespace object {

			///====================================================================
			/// BackBuffer 派生クラス
			///====================================================================

			//@brief	=== バックバッファ派生クラス ===
			class BackBuffer final : public RenderTarget
			{
			public:
				///====================================================================
				/// クラス設定
				///====================================================================

				BackBuffer() = default;
				~BackBuffer() = default;

				///====================================================================
				/// Public メンバー関数
				///====================================================================

				//@brief	=== バックバッファ作成関数 ===
				//@param	swapchain	スワップチェインインスタンス
				//@param	handle	RTVディスクリプタヒープハンドル
				//@return	作成の成否
				[[nodiscard]] HRESULT create_back_buffer(ID3D12Device* device, IDXGISwapChain4* swapchain,
					D3D12_CPU_DESCRIPTOR_HANDLE handle, UINT buffer_index);

			};
		};
	};
};