#pragma once
#include"NonMovable.h"
#include<d3d12.h>
#include<wrl/client.h>

///====================================================================
/// 描画名前空間
///====================================================================

namespace render {

	///====================================================================
	/// DirectX名前空間
	///====================================================================

	namespace dx12 {

		///====================================================================
		/// DX12オブジェクトラッパークラス名前空間
		///====================================================================

		namespace object {

			///====================================================================
			/// CommandQueue クラス
			///====================================================================

			//@brief	=== DirectX12 コマンドキュークラス ===
			class CommandQueue final : public NonMovableBase
			{
			public:
				///====================================================================
				/// クラス設定
				///====================================================================

				//コンストラクタ,デストラクタ
				CommandQueue() = default;
				~CommandQueue() = default;

				///====================================================================
				/// Public メンバー関数
				///====================================================================

				//@brief	=== コマンドキュー作成関数 ===
				//@param	device	DirectX12 デバイス
				//@param	type	コマンドリストタイプ
				//@return	作成の成否
				[[nodiscard]] HRESULT create_command_queue(ID3D12Device* device, D3D12_COMMAND_LIST_TYPE type);

				//@brief	=== コマンドキュー取得関数 ===
				//@return	コマンドキュー参照
				[[nodiscard]] ID3D12CommandQueue* get_command_queue() const noexcept;

			private:
				///====================================================================
				/// Private メンバー変数
				///====================================================================

				//@brief	== コマンドキューインスタンス ==
				Microsoft::WRL::ComPtr<ID3D12CommandQueue> command_queue_{};

			};
		};
	};
};