#pragma once
#include"GPUResource.h"

///====================================================================
/// 描画名前空間
///====================================================================

namespace render {

	///====================================================================
	/// DirectX名前空間
	///====================================================================

	namespace dx12 {


		///====================================================================
		/// DX12オブジェクト設定名前空間
		///====================================================================

		namespace desc {

			///====================================================================
			/// DepthBufferDesc 構造体
			///====================================================================

			//@brief	=== デプスバッファ設定構造体 ===
			struct DepthBufferDesc
			{
				//@brief	== バッファの横幅 ==
				UINT64 width = 1;

				//@brief	== バッファの縦幅 ==
				UINT height = 1;

				//@brief	== バッファのフォーマット ==
				DXGI_FORMAT format = DXGI_FORMAT_D32_FLOAT;

				//@brief	== ピクセルごとのサンプル数 ==
				UINT sample_count = 1;

				//@brief	== クリア時のデプス値 ==
				float clear_depth = 1.0f;

				//@brief	== クリア時のステンシル値 ==
				UINT8 clear_stencil = 0;

			};
		};

		///====================================================================
		/// DX12オブジェクトラッパークラス名前空間
		///====================================================================

		namespace object {

			//@brief	=== デプスバッファクラス ===
			class DepthBuffer final : public GPUResourceBase
			{
			public:
				///====================================================================
				/// クラス設定
				///====================================================================

				//コンストラクタ,デストラクタ
				DepthBuffer() = default;
				~DepthBuffer() = default;

				///====================================================================
				/// Publuc メンバー関数
				///====================================================================

				//@brief	=== デプスバッファ作成関数 ===
				//@param	device	DirectX12 デバイス
				//@param	handle	DSVディスクリプタヒープハンドル
				//@param	desc	デプスバッファ設定
				//@return	作成の成否
				[[nodiscard]] HRESULT create_depth_buffer(ID3D12Device* device, D3D12_CPU_DESCRIPTOR_HANDLE handle, desc::DepthBufferDesc& desc);

				//@brief	=== DSVハンドル取得関数 ===
				//@return	DSV CPUハンドル
				[[nodiscard]] D3D12_CPU_DESCRIPTOR_HANDLE get_dsv_handle()const noexcept;

			private:
				///====================================================================
				/// Private メンバー変数
				///====================================================================

				//@brief	== デプスバッファディスクリプタピープハンドル ==
				D3D12_CPU_DESCRIPTOR_HANDLE	dsv_handle{};

			};
		};
	};
};