#pragma once
#include"NonMovable.h"
#include<dxgi1_6.h>
#include<d3d12.h>
#include<wrl/client.h>

///====================================================================
/// 描画名前空間
///====================================================================

namespace render {

	///====================================================================
	/// DirectX名前空間
	///====================================================================

	namespace dx12 {

		///====================================================================
		/// DX12オブジェクトラッパークラス名前空間
		///====================================================================

		namespace object {

			///====================================================================
			/// DXGIクラス
			///====================================================================

			//@brief	=== DirectX Graphics Interface ===
			class DXGI final : public NonMovableBase
			{
			public:
				///====================================================================
				/// クラス設定
				///====================================================================

				//コンストラクタ,デストラクタ
				DXGI() = default;
				~DXGI() = default;

				///====================================================================
				/// Public メンバー関数
				///====================================================================

				//@brief	=== DXGI初期化関数 ===
				//@return	初期化の成否
				[[nodiscard]] HRESULT initialize_DXGI();

				//@brief	=== DXGIファクトリー取得関数 ===
				//@return	DXGIファクトリー参照
				[[nodiscard]] IDXGIFactory6* get_DXGI_factory() const noexcept;

				//@brief	=== DXGIアダプター取得関数 ===
				//@return	DXGIアダプター参照
				[[nodiscard]] IDXGIAdapter1* get_DXGI_adaptor() const noexcept;

			private:
				///====================================================================
				/// Private メンバー変数
				///====================================================================

				//@brief	== DXGIファクトリーインスタンス ==
				//@details	DirectXオブジェクトを生成するためのファクトリーインスタンス
				Microsoft::WRL::ComPtr<IDXGIFactory6> factory_{};

				//@brief	== DXGIアダプターインスタンス ==
				//@details	
				Microsoft::WRL::ComPtr<IDXGIAdapter1> adapter_{};

				///====================================================================
				/// Private メンバー関数
				///====================================================================

				//@brief	=== DXGIファクトリー作成関数 ===
				//@return	作成の成否
				[[nodiscard]] HRESULT create_DXGI_factory();

				//@brief	=== DXGIアダプター作成関数 ===
				//@return	作成の成否
				[[nodiscard]] HRESULT create_DXGI_adaptor();

			};
		};
	};
};