#pragma once
#include"NonMovable.h"
#include<d3d12.h>
#include<wrl/client.h>

///====================================================================
/// 描画名前空間
///====================================================================

namespace render {

	///====================================================================
	/// DirectX名前空間
	///====================================================================

	namespace dx12 {

		///====================================================================
		/// DX12オブジェクトラッパークラス名前空間
		///====================================================================

		namespace object {

			///====================================================================
			/// Fence クラス
			///====================================================================

			//@brief	=== フェンスクラス ===
			class Fence final : public NonMovableBase
			{
			public:
				///====================================================================
				/// クラス設定
				///====================================================================

				//コンストラクタ,デストラクタ
				Fence() = default;
				~Fence() = default;

				///====================================================================
				/// Public メンバー関数
				///====================================================================

				//@brief	=== フェンス作成関数 ===
				//@param	device	DirectX12 デバイス
				//@return	作成の成否
				[[nodiscard]] HRESULT create_fence(ID3D12Device* device);

				//@brief	コマンドキューにフェンスをシグナル
				//@param	command_queue	フェンスをシグナルするコマンドキュー
				[[nodiscard]] UINT64 signal(ID3D12CommandQueue* command_queue);

				//@brief	フェンスの値を待機
				//@param	completed_value	待機するフェンスの値
				void wait_to_completed_value(UINT64 completed_value) const noexcept;

				//@brief	フェンス値の取得
				//@return	フェンス値
				[[nodiscard]] UINT64 get_completed_value() const noexcept;

				//@brief	=== フェンス取得関数 ===
				//@return	フェンス参照
				[[nodiscard]] ID3D12Fence* get_fence()const noexcept;

			private:
				///====================================================================
				/// メンバー変数
				///====================================================================

				//@brief	== フェンスインスタンス ==
				Microsoft::WRL::ComPtr<ID3D12Fence> fence_{};

				//@brief	== フェンスイベント ==
				HANDLE wait_event{};

				//@brief	== フェンスの値 ==
				UINT64 fence_value{};

			};
		};
	};
};