#pragma once
#include"GPUResource.h"

///====================================================================
/// 描画名前空間
///====================================================================

namespace render {

	///====================================================================
	/// DirectX名前空間
	///====================================================================

	namespace dx12 {

		///====================================================================
		/// DX12オブジェクトラッパークラス名前空間
		///====================================================================

		namespace object {

			///====================================================================
			/// TextureResouce 基底クラス
			///====================================================================

			//@brief	=== 描画リソース基底クラス ===
			class TextureResource : public GPUResourceBase
			{
			public:
				///====================================================================
				/// クラス設定
				///====================================================================

				//コンストラクタ削除
				TextureResource() = delete;

				//@brief	=== 引数付きコンストラクタ ===
				//@param	state	初期設定リソースステート
				TextureResource(D3D12_RESOURCE_STATES state);

				//デストラクタ
				virtual ~TextureResource() = default;

				///====================================================================
				/// Public メンバー関数
				///====================================================================

				//@brief	=== リソースバリア遷移関数 ===
				//@param	list	描画用コマンドリスト
				//@param	next_state	遷移先バリアステート
				void  barrier_transition(ID3D12GraphicsCommandList* list, D3D12_RESOURCE_STATES next_state);

			protected:
				///====================================================================
				/// Protected メンバー変数
				///====================================================================

				//@brief	== リソースステート ==
				D3D12_RESOURCE_STATES current_state{};

			};
		};
	};
};