#pragma once
#include"GPUResource.h"
#include<vector>

///====================================================================
/// 描画名前空間
///====================================================================

namespace render {

	///====================================================================
	/// DirectX名前空間
	///====================================================================

	namespace dx12 {

		///====================================================================
		/// DX12オブジェクトラッパークラス名前空間
		///====================================================================

		namespace object {

			///====================================================================
			/// UploadBufferResource 基底クラス
			///====================================================================

			//@brief	=== 描画バッファリソース更新可能クラス ===
			class UploadBufferResource : public GPUResourceBase
			{
			public:
				///====================================================================
				/// クラス設定
				///====================================================================
				
				UploadBufferResource() = default;
				virtual ~UploadBufferResource() = default;

			protected:
				///====================================================================
				/// Protected メンバー変数
				///====================================================================

				//@brief	== マップ先ポインター ==
				void* mapped_{};

				///====================================================================
				/// Protected メンバー関数
				///====================================================================

				//@brief	=== バッファリソースMap関数 ===
				//@return	Mapの成否
				[[nodiscard]] HRESULT map_buffer();

				//@brief	=== バッファリソースUnmap関数 ===
				void unmap_buffer();

				//@brief	=== データUpload関数 ===
				//@param	src		コピーするデータの先頭ポインター
				//@param	size	コピーするメモリサイズ
				void Upload(const void* src, size_t size);

				//@brief === データUpload関数オーバーロード ===
				//@param	data	コピーするVector配列参照
				template<class T>
				void Upload(const std::vector<T>&data) {
					Upload(data.data(), data.size() * sizeof(T));
				}

			};
		};
	};
};