#pragma once
#include"NonMovable.h"
#include<unordered_map>
#include<memory>
#include<optional>
#include<string>

///====================================================================
/// 前方宣言
///====================================================================

typedef unsigned int        UINT;
class HashAllocator;

///====================================================================
/// StaticContainerBase 基底クラス
///====================================================================

//@brief	=== コンテナ基底クラス ===
class StaticContainerBase : public NonMovableBase
{
public:
	///====================================================================
	/// クラス設定
	///====================================================================

	StaticContainerBase();
	virtual ~StaticContainerBase();

	///====================================================================
	/// Public メンバー関数
	///====================================================================

	//@brief	=== ハッシュキー取得関数 ===
	//@param	key_name	登録したキーの名前
	//@return	ハッシュキー...登録されてないなら [ std::nullopt ] を返す
	[[nodiscard]] std::optional<UINT> get_shader_hash_key(const std::string& key_name)const noexcept;

protected:
	///====================================================================
	/// Protected メンバー変数
	///====================================================================

	//@brief	== ハッシュアロケーターインスタンス ==
	//@details	シェーダーハッシュキー登録クラス
	std::unique_ptr<HashAllocator> hash_allocator{};

	///====================================================================
	/// Protected メンバー関数
	///====================================================================
	

};