#pragma once
#include"NonMovable.h"
#include<unordered_map>
#include<memory>
#include<vector>

///====================================================================
/// 前方宣言
///====================================================================

class HashAllocator;

///====================================================================
/// StaticDrawPassContainer クラス
///====================================================================

//@brief	=== 描画パスコンテナクラス ===
class StaticDrawPassContainer final : public NonMovableBase
{
public:
	///====================================================================
	/// クラス設定
	///====================================================================



private:
	///====================================================================
	/// Private メンバー変数
	///====================================================================
	
	

	//@brief	== ハッシュアロケーターインスタンス ==
	//@details	シェーダーハッシュキー登録クラス
	std::unique_ptr<HashAllocator> hash_allocator{};
};