#pragma once
#include"DrawCommands.h"
#include"PassBase.h"

///====================================================================
/// 描画名前空間
///====================================================================

namespace render {

	///====================================================================
	/// DirectX名前空間
	///====================================================================

	namespace dx12 {

		///====================================================================
		/// DX12オブジェクト設定名前空間
		///====================================================================

		namespace desc {

			//@brief	=== コマンドパス作成補助構造体 ===
			struct CommandPassDesc {

				//@breif	== 描画パスコマンドクラス参照 ==
				command::DrawCommands* command_;

				//@brief	== コンストラクタ ==
				CommandPassDesc() = default;
				CommandPassDesc(
					command::DrawCommands* command
				) : command_(command) {};

			};
		};

		///====================================================================
		/// 描画パス名前空間
		///====================================================================

		namespace pass {

			///====================================================================
			/// CommandPass クラス
			///====================================================================

			//@brief	=== コマンドパスクラス ===
			class CommandPass final : public PassBase
			{
			public:
				///====================================================================
				/// クラス設定
				///====================================================================

				//コンストラクタ,デストラクタ
				CommandPass() = default;
				~CommandPass() = default;

				///====================================================================
				/// Public メンバー関数
				///====================================================================

				//@brief	=== コマンドパス初期化関数 ===
				//@param	desc	コマンドパス作成補助構造体
				//@return	作成の成否
				[[nodiscard]] bool initialize_pass(desc::CommandPassDesc& desc);

				//@brief	=== コマンドパス実行関数 ===
				//@param	resource	描画リソース
				void apply(resources::DrawResources& resource) override;

			private:
				///====================================================================
				/// Private メンバー変数
				///====================================================================

				//@brief	== コマンドパスコマンド設定クラス参照 ==
				command::DrawCommands* draw_commands{};

			};
		};
	};
};