#pragma once
#include"../DrawResouces.h"
#include"NonMovable.h"
#include<vector>
#include<optional>

///====================================================================
/// 描画名前空間
///====================================================================

namespace render {

	///====================================================================
	/// DirectX名前空間
	///====================================================================

	namespace dx12 {

		///====================================================================
		/// 描画設定名前空間
		///====================================================================

		namespace state {

			///====================================================================
			/// DrawRenderTargets クラス
			///====================================================================

			//@brief	=== 描画パス用レンダーターゲット設定クラス ===
			class DrawRenderTargetState final : public NonMovableBase
			{
			public:
				///====================================================================
				/// クラス設定
				///====================================================================

				//コンストラクタ,デストラクタ
				DrawRenderTargetState() = default;
				~DrawRenderTargetState() = default;

				///====================================================================
				/// Public メンバー関数
				///====================================================================

				//@brief	=== 描画先設定追加関数 ===
				//@param	slot	追加するターゲットの種類
				void add_render_target_slot(RenderTargetSlot slot);

				//@brief	=== デプスバッファ設定関数 ===
				//@param	slot	設定するDSVの種類
				void set_depth(DepthSlot slot);

				//@brief	=== 描画パス実行時レンダーターゲットバインド関数 ==
				//@param	resouce	描画リソース
				void apply(resources::DrawResources& resouce);

			private:
				///====================================================================
				/// Private メンバー変数
				///====================================================================

				//@brief	== 追加するレンダーターゲットの設定 ==
				std::vector<RenderTargetSlot> render_targets_slot{};

				//@brief	== 追加するDSVの設定 ==
				std::optional<DepthSlot> depth_slot{};

			};
		};
	};
};